xwos/XWOS/xwcd/soc/powerpc/e200x/e200z0h/mpc560xb/mpc5604b.h
/**
 * @file
 * @brief register definations of mpc5604b
 * @note
 * This file is generated by codewarrior.
 */

/*****************************************************************
 *
 * FILE        : MPC5604B_0M27V_0100.h
 *
 * DESCRIPTION : This is the header file describing the register
 *               set for:
 *	             MPC5604B, mask set = 0M27V
 *               SPC560B4, mask set = FB50X20B
 *
 * COPYRIGHT   :(c) 2009, Freescale & STMicroelectronics
 *
 * VERSION     : 01.00
 * DATE        : 08 MAY 2009
 * AUTHOR      : b04629
 * HISTORY     : Original source taken from jdp_0100.h.
 *               Updated to be compatable with
 *               - MPC5604B Mask ID 0M27V
 *               - MPC5604B Reference Manual Rev 3 Draft A
 *               - SPC560B4 Mask ID FB50X20B
 *               - SPC560B4 Reference Manual Rev 3 Draft A
 *
 ******************************************************************/

/*>>>>NOTE! this file is auto-generated please do not edit it!<<<<*/

/*****************************************************************
* Example instantiation and use:
*
*  <MODULE>.<REGISTER>.B.<BIT> = 1;
*  <MODULE>.<REGISTER>.R       = 0x10000000;
*
******************************************************************/

#ifndef __mpc5_reg_h__
#define __mpc5_reg_h__

#include <xwos/standard.h>


#ifdef  __cplusplus
extern "C" {
#endif

#ifdef __MWERKS__
#pragma push
#pragma ANSI_strict off
#endif  /*
 */
/****************************************************************************/
/*                          MODULE : ADC                                   */
/****************************************************************************/
    struct ADC_tag {
        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t OWREN:1;
                volatile uint32_t WLSIDE:1;
                volatile uint32_t MODE:1;
                  volatile uint32_t:4;
                volatile uint32_t NSTART:1;
                  volatile uint32_t:1;
                volatile uint32_t JTRGEN:1;
                volatile uint32_t JEDGE:1;
                volatile uint32_t JSTART:1;
                  volatile uint32_t:2;
                volatile uint32_t CTUEN:1;
                  volatile uint32_t:8;
                volatile uint32_t ADCLKSEL:1;
                volatile uint32_t ABORTCHAIN:1;
                volatile uint32_t ABORT:1;
                volatile uint32_t ACK0:1;
                  volatile uint32_t:4;
                volatile uint32_t PWDN:1;
            } B;
        } MCR;                  /* MAIN CONFIGURATION REGISTER */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:7;
                volatile uint32_t NSTART:1;
                volatile uint32_t JABORT:1;
                  volatile uint32_t:2;
                volatile uint32_t JSTART:1;
                  volatile uint32_t:3;
                volatile uint32_t CTUSTART:1;
                volatile uint32_t CHADDR:7;
                  volatile uint32_t:3;
                volatile uint32_t ACK0:1;
                  volatile uint32_t:2;
                volatile uint32_t ADCSTATUS:3;
            } B;
        } MSR;                  /* MAIN STATUS REGISTER */

        int32_t ADC_reserved1[2];       /* (0x010 - 0x008)/4 = 0x02 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:27;
                volatile uint32_t EOCTU:1;
                volatile uint32_t JEOC:1;
                volatile uint32_t JECH:1;
                volatile uint32_t EOC:1;
                volatile uint32_t ECH:1;
            } B;
        } ISR;                  /* INTERRUPT STATUS REGISTER */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t EOC_CH31:1;
                volatile uint32_t EOC_CH30:1;
                volatile uint32_t EOC_CH29:1;
                volatile uint32_t EOC_CH28:1;
                volatile uint32_t EOC_CH27:1;
                volatile uint32_t EOC_CH26:1;
                volatile uint32_t EOC_CH25:1;
                volatile uint32_t EOC_CH24:1;
                volatile uint32_t EOC_CH23:1;
                volatile uint32_t EOC_CH22:1;
                volatile uint32_t EOC_CH21:1;
                volatile uint32_t EOC_CH20:1;
                volatile uint32_t EOC_CH19:1;
                volatile uint32_t EOC_CH18:1;
                volatile uint32_t EOC_CH17:1;
                volatile uint32_t EOC_CH16:1;
                volatile uint32_t EOC_CH15:1;
                volatile uint32_t EOC_CH14:1;
                volatile uint32_t EOC_CH13:1;
                volatile uint32_t EOC_CH12:1;
                volatile uint32_t EOC_CH11:1;
                volatile uint32_t EOC_CH10:1;
                volatile uint32_t EOC_CH9:1;
                volatile uint32_t EOC_CH8:1;
                volatile uint32_t EOC_CH7:1;
                volatile uint32_t EOC_CH6:1;
                volatile uint32_t EOC_CH5:1;
                volatile uint32_t EOC_CH4:1;
                volatile uint32_t EOC_CH3:1;
                volatile uint32_t EOC_CH2:1;
                volatile uint32_t EOC_CH1:1;
                volatile uint32_t EOC_CH0:1;
            } B;
        } CEOCFR[3];            /* Channel Pending Register 0 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:27;
                volatile uint32_t MSKEOCTU:1;
                volatile uint32_t MSKJEOC:1;
                volatile uint32_t MSKJECH:1;
                volatile uint32_t MSKEOC:1;
                volatile uint32_t MSKECH:1;
            } B;
        } IMR;                  /* INTERRUPT MASK REGISTER */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t CIM31:1;
                volatile uint32_t CIM30:1;
                volatile uint32_t CIM29:1;
                volatile uint32_t CIM28:1;
                volatile uint32_t CIM27:1;
                volatile uint32_t CIM26:1;
                volatile uint32_t CIM25:1;
                volatile uint32_t CIM24:1;
                volatile uint32_t CIM23:1;
                volatile uint32_t CIM22:1;
                volatile uint32_t CIM21:1;
                volatile uint32_t CIM20:1;
                volatile uint32_t CIM19:1;
                volatile uint32_t CIM18:1;
                volatile uint32_t CIM17:1;
                volatile uint32_t CIM16:1;
                volatile uint32_t CIM15:1;
                volatile uint32_t CIM14:1;
                volatile uint32_t CIM13:1;
                volatile uint32_t CIM12:1;
                volatile uint32_t CIM11:1;
                volatile uint32_t CIM10:1;
                volatile uint32_t CIM9:1;
                volatile uint32_t CIM8:1;
                volatile uint32_t CIM7:1;
                volatile uint32_t CIM6:1;
                volatile uint32_t CIM5:1;
                volatile uint32_t CIM4:1;
                volatile uint32_t CIM3:1;
                volatile uint32_t CIM2:1;
                volatile uint32_t CIM1:1;
                volatile uint32_t CIM0:1;
            } B;
        } CIMR[3];              /* Channel Interrupt Mask Register 0 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:24;
                volatile uint32_t WDG3H:1;
                volatile uint32_t WDG2H:1;
                volatile uint32_t WDG1H:1;
                volatile uint32_t WDG0H:1;
                volatile uint32_t WDG3L:1;
                volatile uint32_t WDG2L:1;
                volatile uint32_t WDG1L:1;
                volatile uint32_t WDG0L:1;
            } B;
        } WTISR;                /* WATCHDOG INTERRUPT THRESHOLD REGISTER */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:24;
                volatile uint32_t MSKWDG3H:1;
                volatile uint32_t MSKWDG2H:1;
                volatile uint32_t MSKWDG1H:1;
                volatile uint32_t MSKWDG0H:1;
                volatile uint32_t MSKWDG3L:1;
                volatile uint32_t MSKWDG2L:1;
                volatile uint32_t MSKWDG1L:1;
                volatile uint32_t MSKWDG0L:1;
            } B;
        } WTIMR;                /* WATCHDOG INTERRUPT MASK REGISTER */

        int32_t ADC_reserved2[6];       /* (0x050 - 0x038)/4 = 0x06 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t THREN:1;
                volatile uint32_t THRINV:1;
                  volatile uint32_t:7;
                volatile uint32_t THRCH:7;
            } B;
        } TRC[4];               /* ADC THRESHOLD REGISTER REGISTER */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:4;
                volatile uint32_t THRH:12;
                  volatile uint32_t:4;
                volatile uint32_t THRL:12;
            } B;
        } THRHLR[4];            /* THRESHOLD REGISTER */

        int32_t ADC_reserved3[4];       /* (0x080 - 0x070)/4 = 0x04 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:25;
                volatile uint32_t PREVAL2:2;
                volatile uint32_t PREVAL1:2;
                volatile uint32_t PREVAL0:2;
                volatile uint32_t PRECONV:1;
            } B;
        } PSCR;                 /* PRESAMPLING CONTROL REGISTER */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t PRES31:1;
                volatile uint32_t PRES30:1;
                volatile uint32_t PRES29:1;
                volatile uint32_t PRES28:1;
                volatile uint32_t PRES27:1;
                volatile uint32_t PRES26:1;
                volatile uint32_t PRES25:1;
                volatile uint32_t PRES24:1;
                volatile uint32_t PRES23:1;
                volatile uint32_t PRES22:1;
                volatile uint32_t PRES21:1;
                volatile uint32_t PRES20:1;
                volatile uint32_t PRES19:1;
                volatile uint32_t PRES18:1;
                volatile uint32_t PRES17:1;
                volatile uint32_t PRES16:1;
                volatile uint32_t PRES15:1;
                volatile uint32_t PRES14:1;
                volatile uint32_t PRES13:1;
                volatile uint32_t PRES12:1;
                volatile uint32_t PRES11:1;
                volatile uint32_t PRES10:1;
                volatile uint32_t PRES9:1;
                volatile uint32_t PRES8:1;
                volatile uint32_t PRES7:1;
                volatile uint32_t PRES6:1;
                volatile uint32_t PRES5:1;
                volatile uint32_t PRES4:1;
                volatile uint32_t PRES3:1;
                volatile uint32_t PRES2:1;
                volatile uint32_t PRES1:1;
                volatile uint32_t PRES0:1;
            } B;
        } PSR[3];               /* PRESAMPLING REGISTER */

