xwos/XWOS/xwcd/soc/powerpc/e200x/e200z0h/mpc560xb/mpc5604b.h
        int32_t ADC_reserved4[1];       /* (0x094 - 0x090)/4 = 0x01 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t INPLATCH:1;
                  volatile uint32_t:4;
                volatile uint32_t INPCMP:2;
                  volatile uint32_t:1;
                volatile uint32_t INPSAMP:8;
            } B;
        } CTR[3];               /* CONVERSION TIMING REGISTER */

        int32_t ADC_reserved5[1];       /* (0x0A4 - 0x0A0)/4 = 0x01 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t CH31:1;
                volatile uint32_t CH30:1;
                volatile uint32_t CH29:1;
                volatile uint32_t CH28:1;
                volatile uint32_t CH27:1;
                volatile uint32_t CH26:1;
                volatile uint32_t CH25:1;
                volatile uint32_t CH24:1;
                volatile uint32_t CH23:1;
                volatile uint32_t CH22:1;
                volatile uint32_t CH21:1;
                volatile uint32_t CH20:1;
                volatile uint32_t CH19:1;
                volatile uint32_t CH18:1;
                volatile uint32_t CH17:1;
                volatile uint32_t CH16:1;
                volatile uint32_t CH15:1;
                volatile uint32_t CH14:1;
                volatile uint32_t CH13:1;
                volatile uint32_t CH12:1;
                volatile uint32_t CH11:1;
                volatile uint32_t CH10:1;
                volatile uint32_t CH9:1;
                volatile uint32_t CH8:1;
                volatile uint32_t CH7:1;
                volatile uint32_t CH6:1;
                volatile uint32_t CH5:1;
                volatile uint32_t CH4:1;
                volatile uint32_t CH3:1;
                volatile uint32_t CH2:1;
                volatile uint32_t CH1:1;
                volatile uint32_t CH0:1;
            } B;
        } NCMR[3];              /* NORMAL CONVERSION MASK REGISTER */

        int32_t ADC_reserved6[1];       /* (0x0B4 - 0x0B0)/4 = 0x01 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t CH31:1;
                volatile uint32_t CH30:1;
                volatile uint32_t CH29:1;
                volatile uint32_t CH28:1;
                volatile uint32_t CH27:1;
                volatile uint32_t CH26:1;
                volatile uint32_t CH25:1;
                volatile uint32_t CH24:1;
                volatile uint32_t CH23:1;
                volatile uint32_t CH22:1;
                volatile uint32_t CH21:1;
                volatile uint32_t CH20:1;
                volatile uint32_t CH19:1;
                volatile uint32_t CH18:1;
                volatile uint32_t CH17:1;
                volatile uint32_t CH16:1;
                volatile uint32_t CH15:1;
                volatile uint32_t CH14:1;
                volatile uint32_t CH13:1;
                volatile uint32_t CH12:1;
                volatile uint32_t CH11:1;
                volatile uint32_t CH10:1;
                volatile uint32_t CH9:1;
                volatile uint32_t CH8:1;
                volatile uint32_t CH7:1;
                volatile uint32_t CH6:1;
                volatile uint32_t CH5:1;
                volatile uint32_t CH4:1;
                volatile uint32_t CH3:1;
                volatile uint32_t CH2:1;
                volatile uint32_t CH1:1;
                volatile uint32_t CH0:1;
            } B;
        } JCMR[3];              /* Injected CONVERSION MASK REGISTER */

        int32_t ADC_reserved7[1];       /* (0x0C4 - 0x0C0)/4 = 0x01 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:24;
                volatile uint32_t DSD:8;
            } B;
        } DSDR;                 /* DECODE SIGNALS DELAY REGISTER */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:24;
                volatile uint32_t PDED:8;
            } B;
        } PDEDR;                /* POWER DOWN DELAY REGISTER */

        int32_t ADC_reserved8[13];      /* (0x100 - 0x0CC)/4 = 0x0D */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:12;
                volatile uint32_t VALID:1;
                volatile uint32_t OVERW:1;
                volatile uint32_t RESULT:2;
                  volatile uint32_t:6;
                volatile uint32_t CDATA:10;
            } B;
        } CDR[96];              /* Channel 0-95 Data REGISTER */

    };                          /* end of ADC_tag */
/****************************************************************************/
/*                          MODULE : CANSP                                   */
/****************************************************************************/
    struct CANSP_tag {
        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t RX_COMPLETE:1;
                volatile uint32_t BUSY:1;
                volatile uint32_t ACTIVE_CK:1;
                  volatile uint32_t:3;
                volatile uint32_t MODE:1;
                volatile uint32_t CAN_RX_SEL:3;
                volatile uint32_t BRP:5;
                volatile uint32_t CAN_SMPLR_EN:1;
            } B;
        } CR;                   /* CANSP Control Register */

        union {
            volatile uint32_t R;
        } SR[12];               /* CANSP Sample Register 0 to 11 */

    };                          /* end of CANSP_tag */
/****************************************************************************/
/*                     MODULE : CFLASH                                       */
/****************************************************************************/
    struct CFLASH_tag {
        union {                 /* Module Configuration Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t EDC:1;
                  volatile uint32_t:4;
                volatile uint32_t SIZE:3;
                  volatile uint32_t:1;
                volatile uint32_t LAS:3;
                  volatile uint32_t:3;
                volatile uint32_t MAS:1;
                volatile uint32_t EER:1;
                volatile uint32_t RWE:1;
                  volatile uint32_t:1;
                  volatile uint32_t:1;
                volatile uint32_t PEAS:1;
                volatile uint32_t DONE:1;
                volatile uint32_t PEG:1;
                  volatile uint32_t:4;
                volatile uint32_t PGM:1;
                volatile uint32_t PSUS:1;
                volatile uint32_t ERS:1;
                volatile uint32_t ESUS:1;
                volatile uint32_t EHV:1;
            } B;
        } MCR;

