xwos/XWOS/xwcd/soc/powerpc/e200x/e200z0h/mpc560xb/mpc5604b.h
        union {                 /* LML Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t LME:1;
                  volatile uint32_t:10;
                volatile uint32_t TSLK:1;
                  volatile uint32_t:2;
                volatile uint32_t MLK:2;
                volatile uint32_t LLK:16;
            } B;
        } LML;

        union {                 /* HBL Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t HBE:1;
                  volatile uint32_t:23;
                volatile uint32_t HBLOCK:8;
            } B;
        } HBL;

        union {                 /* SLML Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t SLE:1;
                  volatile uint32_t:10;
                volatile uint32_t STSLK:1;
                  volatile uint32_t:2;
                volatile uint32_t SMK:2;
                volatile uint32_t SLK:16;
            } B;
        } SLL;

        union {                 /* LMS Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t:14;
                volatile uint32_t MSL:2;
                volatile uint32_t LSL:16;
            } B;
        } LMS;

        union {                 /* High Address Space Block Select Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t:26;
                volatile uint32_t HSL:6;
            } B;
        } HBS;

        union {                 /* Address Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t:10;
                volatile uint32_t ADD:19;
                  volatile uint32_t:3;
            } B;
        } ADR;

        union {                 /* CFLASH Configuration Register 0 */
            volatile uint32_t R;
            struct {
                volatile uint32_t BK0_APC:5;
                volatile uint32_t BK0_WWSC:5;
                volatile uint32_t BK0_RWSC:5;
                volatile uint32_t BK0_RWWC2:1;
                volatile uint32_t BK0_RWWC1:1;
                volatile uint32_t B0_P1_BCFG:2;
                volatile uint32_t B0_P1_DPFE:1;
                volatile uint32_t B0_P1_IPFE:1;
                volatile uint32_t B0_P1_PFLM:2;
                volatile uint32_t B0_P1_BFE:1;
                volatile uint32_t BK0_RWWC0:1;
                volatile uint32_t B0_P0_BCFG:2;
                volatile uint32_t B0_P0_DPFE:1;
                volatile uint32_t B0_P0_IPFE:1;
                volatile uint32_t B0_P0_PFLM:2;
                volatile uint32_t B0_P0_BFE:1;
            } B;
        } PFCR0;

        union {                 /* CFLASH Configuration Register 1 */
            volatile uint32_t R;
            struct {
                volatile uint32_t BK1_APC:5;
                volatile uint32_t BK1_WWSC:5;
                volatile uint32_t BK1_RWSC:5;
                volatile uint32_t BK1_RWWC2:1;
                volatile uint32_t BK1_RWWC1:1;
                  volatile uint32_t:6;
                volatile uint32_t B0_P1_BFE:1;
                volatile uint32_t BK1_RWWC0:1;
                  volatile uint32_t:6;
                volatile uint32_t B1_P0_BFE:1;
            } B;
        } PFCR1;

        union {                 /* cflash Access Protection Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t:6;
                volatile uint32_t ARBM:2;
                volatile uint32_t M7PFD:1;
                volatile uint32_t M6PFD:1;
                volatile uint32_t M5PFD:1;
                volatile uint32_t M4PFD:1;
                volatile uint32_t M3PFD:1;
                volatile uint32_t M2PFD:1;
                volatile uint32_t M1PFD:1;
                volatile uint32_t M0PFD:1;
                volatile uint32_t M7AP:2;
                volatile uint32_t M6AP:2;
                volatile uint32_t M5AP:2;
                volatile uint32_t M4AP:2;
                volatile uint32_t M3AP:2;
                volatile uint32_t M2AP:2;
                volatile uint32_t M1AP:2;
                volatile uint32_t M0AP:2;
            } B;
        } PFAPR;

        int32_t CFLASH_reserved0[5];    /* {0x003C-0x0028}/0x4 = 0x05 */

        union {                 /* User Test Register 0 */
            volatile uint32_t R;
            struct {
                volatile uint32_t UTE:1;
                  volatile uint32_t:7;
                volatile uint32_t DSI:8;
                  volatile uint32_t:10;
                volatile uint32_t MRE:1;
                volatile uint32_t MRV:1;
                volatile uint32_t EIE:1;
                volatile uint32_t AIS:1;
                volatile uint32_t AIE:1;
                volatile uint32_t AID:1;
            } B;
        } UT0;

        union {                 /* User Test Register 1 */
            volatile uint32_t R;
            struct {
                volatile uint32_t DAI:32;
            } B;
        } UT1;

        union {                 /* User Test Register 2 */
            volatile uint32_t R;
            struct {
                volatile uint32_t DAI:32;
            } B;
        } UT2;

        union {                 /* User Multiple Input Signature Register 0-4 */
            volatile uint32_t R;
            struct {
                volatile uint32_t MS:32;
            } B;
        } UMISR[5];

    };                          /* end of CFLASH_tag */
/****************************************************************************/
/*                          MODULE : CGM                                   */
/****************************************************************************/
    struct CGM_tag {

        /* The CGM provides a unified register interface, enabling access to

           all clock sources:

           Base Address | Clock Sources

           -----------------------------

           0xC3FE0000   | FXOSC_CTL

