xwos/XWOS/xwcd/soc/powerpc/e200x/e200z0h/mpc560xb/mpc5604b.h
           ----------   | Reserved

           0xC3FE0040   | SXOSC_CTL

           0xC3FE0060   | FIRC_CTL

           0xC3FE0080   | SIRC_CTL

           0xC3FE00A0   | FMPLL_0

           ----------   | Reserved

           0xC3FE0100   | CMU_0

         */
    /************************************/
        /* FXOSC_CTL @ CGM base address + 0x0000 */
    /************************************/
        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t OSCBYP:1;
                  volatile uint32_t:7;
                volatile uint32_t EOCV:8;
                volatile uint32_t M_OSC:1;
                  volatile uint32_t:2;
                volatile uint32_t OSCDIV:5;
                volatile uint32_t I_OSC:1;
                  volatile uint32_t:7;
            } B;
        } FXOSC_CTL;            /* Fast OSC Control Register */

    /************************************/
        /* SXOSC_CTL @ CGM base address + 0x0040 */
    /************************************/
        int32_t CGM_reserved0[15];      /* (0x040 - 0x004)/4 = 0x0F */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t OSCBYP:1;
                  volatile uint32_t:7;
                volatile uint32_t EOCV:8;
                volatile uint32_t M_OSC:1;
                  volatile uint32_t:2;
                volatile uint32_t OSCDIV:5;
                volatile uint32_t I_OSC:1;
                  volatile uint32_t:5;
                volatile uint32_t S_OSC:1;
                volatile uint32_t OSCON:1;
            } B;
        } SXOSC_CTL;            /* Slow OSC Control Register */

    /************************************/
        /* FIRC_CTL @ CGM base address + 0x0060 */
    /************************************/
        int32_t CGM_reserved1[7];       /* (0x060 - 0x044)/4 = 0x07 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:10;
                volatile uint32_t RCTRIM:6;
                  volatile uint32_t:3;
                volatile uint32_t RCDIV:5;
                  volatile uint32_t:8;
            } B;
        } FIRC_CTL;             /* Fast IRC Control Register */

    /****************************************/
        /* SIRC_CTL @ CGM base address + 0x0080 */
    /****************************************/
        int32_t CGM_reserved2[7];       /* (0x080 - 0x064)/4 = 0x07 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:11;
                volatile uint32_t RCTRIM:5;
                  volatile uint32_t:3;
                volatile uint32_t RCDIV:5;
                  volatile uint32_t:3;
                volatile uint32_t S_SIRC:1;
                  volatile uint32_t:3;
                volatile uint32_t SIRCON_STDBY:1;
            } B;
        } SIRC_CTL;             /* Slow IRC Control Register */

    /*************************************/
        /* FMPLL @ CGM base address + 0x00A0 */
    /*************************************/
        int32_t CGM_reserved3[7];       /* (0x0A0 - 0x084)/4 = 0x07 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:2;
                volatile uint32_t IDF:4;
                volatile uint32_t ODF:2;
                  volatile uint32_t:1;
                volatile uint32_t NDIV:7;
                  volatile uint32_t:7;
                volatile uint32_t EN_PLL_SW:1;
                volatile uint32_t MODE:1;
                volatile uint32_t UNLOCK_ONCE:1;
                  volatile uint32_t:1;
                volatile uint32_t I_LOCK:1;
                volatile uint32_t S_LOCK:1;
                volatile uint32_t PLL_FAIL_MASK:1;
                volatile uint32_t PLL_FAIL_FLAG:1;
                  volatile uint32_t:1;
            } B;
        } FMPLL_CR;             /* FMPLL Control Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t STRB_BYPASS:1;
                  volatile uint32_t:1;
                volatile uint32_t SPRD_SEL:1;
                volatile uint32_t MOD_PERIOD:13;
                volatile uint32_t FM_EN:1;
                volatile uint32_t INC_STEP:15;
            } B;
        } FMPLL_MR;             /* FMPLL Modulation Register */

    /************************************/
        /* CMU @ CGM base address + 0x0100  */
    /************************************/
        int32_t CGM_reserved5[22];      /* (0x100 - 0x0A8)/4 = 0x16 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:8;
                volatile uint32_t SFM:1;
                  volatile uint32_t:13;
                volatile uint32_t CLKSEL1:2;
                  volatile uint32_t:5;
                volatile uint32_t RCDIV:2;
                volatile uint32_t CME_A:1;
            } B;
        } CMU_CSR;              /* Control Status Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:12;
                volatile uint32_t FD:20;
            } B;
        } CMU_FDR;              /* Frequency Display Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:20;
                volatile uint32_t HFREF_A:12;
            } B;
        } CMU_HFREFR_A;         /* High Frequency Reference Register PLL_A Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:20;
                volatile uint32_t LFREF_A:12;
            } B;
        } CMU_LFREFR_A;         /* Low Frequency Reference Register PLL_A Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:28;
                volatile uint32_t FLCI_A:1;
                volatile uint32_t FHHI_A:1;
                volatile uint32_t FLLI_A:1;
                volatile uint32_t OLRI:1;
            } B;
        } CMU_ISR;              /* Interrupt Status Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:32;
            } B;
        } CMU_IMR;              /* Interrupt Mask Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:12;
                volatile uint32_t MD:20;
            } B;
        } CMU_MDR;              /* Measurement Duration Register */

