xwos/XWOS/xwcd/soc/powerpc/e200x/e200z0h/mpc560xb/mpc5604b.h
    /************************************/
        /* CGM General Registers @ CGM base address + 0x0370 */
    /************************************/
        int32_t CGM_reserved7[149];     /* (0x370 - 0x11C)/4 = 0x95 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:31;
                volatile uint32_t EN:1;
            } B;
        } OC_EN;                /* Output Clock Enable Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:2;
                volatile uint32_t SELDIV:2;
                volatile uint32_t SELCTL:4;
                  volatile uint32_t:24;
            } B;
        } OCDS_SC;              /* Output Clock Division Select Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:4;
                volatile uint32_t SELSTAT:4;
                  volatile uint32_t:24;
            } B;
        } SC_SS;                /* System Clock Select Status */

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t DE:1;
                  volatile uint8_t:3;
                volatile uint8_t DIV:4;
            } B;
        } SC_DC[3];             /* System Clock Divider Configuration 0->2 */

    };                          /* end of CGM_tag */
/****************************************************************************/
/*                          MODULE : CTU                                   */
/****************************************************************************/
    struct CTU_tag {
        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:24;
                volatile uint32_t TRGIEN:1;
                volatile uint32_t TRGI:1;
                  volatile uint32_t:6;
            } B;
        } CSR;                  /* Control Status Register */

        int32_t CTU_reserved0[11];      /* (0x030 - 0x004)/4 = 0x0B */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t TM:1;
                  volatile uint32_t:7;
                volatile uint32_t CLR_FLAG:1;
                  volatile uint32_t:1;
                volatile uint32_t CHANNELVALUE:6;
            } B;
        } EVTCFGR[64];          /* Event Configuration Register */

    };                          /* end of CTU_tag */
/****************************************************************************/
/*                     MODULE : DFLASH                                       */
/****************************************************************************/
    struct DFLASH_tag {
        union {                 /* Module Configuration Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t EDC:1;
                  volatile uint32_t:4;
                volatile uint32_t SIZE:3;
                  volatile uint32_t:1;
                volatile uint32_t LAS:3;
                  volatile uint32_t:3;
                volatile uint32_t MAS:1;
                volatile uint32_t EER:1;
                volatile uint32_t RWE:1;
                  volatile uint32_t:1;
                  volatile uint32_t:1;
                volatile uint32_t PEAS:1;
                volatile uint32_t DONE:1;
                volatile uint32_t PEG:1;
                  volatile uint32_t:4;
                volatile uint32_t PGM:1;
                volatile uint32_t PSUS:1;
                volatile uint32_t ERS:1;
                volatile uint32_t ESUS:1;
                volatile uint32_t EHV:1;
            } B;
        } MCR;

        union {                 /* LML Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t LME:1;
                  volatile uint32_t:10;
                volatile uint32_t TSLK:1;
                  volatile uint32_t:2;
                volatile uint32_t MLK:2;
                volatile uint32_t LLK:16;
            } B;
        } LML;

        union {                 /* HBL Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t HBE:1;
                  volatile uint32_t:23;
                volatile uint32_t HBLOCK:8;
            } B;
        } HBL;

        union {                 /* SLML Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t SLE:1;
                  volatile uint32_t:10;
                volatile uint32_t STSLK:1;
                  volatile uint32_t:2;
                volatile uint32_t SMK:2;
                volatile uint32_t SLK:16;
            } B;
        } SLL;

        union {                 /* LMS Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t:14;
                volatile uint32_t MSL:2;
                volatile uint32_t LSL:16;
            } B;
        } LMS;

        union {                 /* High Address Space Block Select Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t:26;
                volatile uint32_t HSL:6;
            } B;
        } HBS;

        union {                 /* Address Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t:10;
                volatile uint32_t ADD:19;
                  volatile uint32_t:3;
            } B;
        } ADR;

        int32_t Dflash_reserved0[8];    /* {0x003C-0x001C}/0x4 = 0x08 */

        union {                 /* User Test Register 0 */
            volatile uint32_t R;
            struct {
                volatile uint32_t UTE:1;
                  volatile uint32_t:7;
                volatile uint32_t DSI:8;
                  volatile uint32_t:10;
                volatile uint32_t MRE:1;
                volatile uint32_t MRV:1;
                volatile uint32_t EIE:1;
                volatile uint32_t AIS:1;
                volatile uint32_t AIE:1;
                volatile uint32_t AID:1;
            } B;
        } UT0;

        union {                 /* User Test Register 1 */
            volatile uint32_t R;
            struct {
                volatile uint32_t DAI:32;
            } B;
        } UT1;

        union {                 /* User Test Register 2 */
            volatile uint32_t R;
            struct {
                volatile uint32_t DAI:32;
            } B;
        } UT2;

