xwos/XWOS/xwcd/soc/powerpc/e200x/e200z0h/mpc560xb/mpc5604b.h
        union {                 /* User Multiple Input Signature Register 0-4 */
            volatile uint32_t R;
            struct {
                volatile uint32_t MS:32;
            } B;
        } UMISR[5];

    };                          /* end of Dflash_tag */
/****************************************************************************/
/*                          MODULE : DSPI                                   */
/****************************************************************************/
    struct DSPI_tag {
        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t MSTR:1;
                volatile uint32_t CONT_SCKE:1;
                volatile uint32_t DCONF:2;
                volatile uint32_t FRZ:1;
                volatile uint32_t MTFE:1;
                volatile uint32_t PCSSE:1;
                volatile uint32_t ROOE:1;
                  volatile uint32_t:2;
                volatile uint32_t PCSIS5:1;
                volatile uint32_t PCSIS4:1;
                volatile uint32_t PCSIS3:1;
                volatile uint32_t PCSIS2:1;
                volatile uint32_t PCSIS1:1;
                volatile uint32_t PCSIS0:1;
                volatile uint32_t DOZE:1;
                volatile uint32_t MDIS:1;
                volatile uint32_t DIS_TXF:1;
                volatile uint32_t DIS_RXF:1;
                volatile uint32_t CLR_TXF:1;
                volatile uint32_t CLR_RXF:1;
                volatile uint32_t SMPL_PT:2;
                  volatile uint32_t:7;
                volatile uint32_t HALT:1;
            } B;
        } MCR;                  /* Module Configuration Register */

        uint32_t dspi_reserved1;

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t TCNT:16;
                  volatile uint32_t:16;
            } B;
        } TCR;

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t DBR:1;
                volatile uint32_t FMSZ:4;
                volatile uint32_t CPOL:1;
                volatile uint32_t CPHA:1;
                volatile uint32_t LSBFE:1;
                volatile uint32_t PCSSCK:2;
                volatile uint32_t PASC:2;
                volatile uint32_t PDT:2;
                volatile uint32_t PBR:2;
                volatile uint32_t CSSCK:4;
                volatile uint32_t ASC:4;
                volatile uint32_t DT:4;
                volatile uint32_t BR:4;
            } B;
        } CTAR[8];              /* Clock and Transfer Attributes Registers */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t TCF:1;
                volatile uint32_t TXRXS:1;
                  volatile uint32_t:1;
                volatile uint32_t EOQF:1;
                volatile uint32_t TFUF:1;
                  volatile uint32_t:1;
                volatile uint32_t TFFF:1;
                  volatile uint32_t:5;
                volatile uint32_t RFOF:1;
                  volatile uint32_t:1;
                volatile uint32_t RFDF:1;
                  volatile uint32_t:1;
                volatile uint32_t TXCTR:4;
                volatile uint32_t TXNXTPTR:4;
                volatile uint32_t RXCTR:4;
                volatile uint32_t POPNXTPTR:4;
            } B;
        } SR;                   /* Status Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t TCFRE:1;
                  volatile uint32_t:2;
                volatile uint32_t EOQFRE:1;
                volatile uint32_t TFUFRE:1;
                  volatile uint32_t:1;
                volatile uint32_t TFFFRE:1;
                volatile uint32_t TFFFDIRS:1;
                  volatile uint32_t:4;
                volatile uint32_t RFOFRE:1;
                  volatile uint32_t:1;
                volatile uint32_t RFDFRE:1;
                volatile uint32_t RFDFDIRS:1;
                  volatile uint32_t:16;
            } B;
        } RSER;                 /* DMA/Interrupt Request Select and Enable Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t CONT:1;
                volatile uint32_t CTAS:3;
                volatile uint32_t EOQ:1;
                volatile uint32_t CTCNT:1;
                  volatile uint32_t:4;
                volatile uint32_t PCS5:1;
                volatile uint32_t PCS4:1;
                volatile uint32_t PCS3:1;
                volatile uint32_t PCS2:1;
                volatile uint32_t PCS1:1;
                volatile uint32_t PCS0:1;
                volatile uint32_t TXDATA:16;
            } B;
        } PUSHR;                /* PUSH TX FIFO Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t RXDATA:16;
            } B;
        } POPR;                 /* POP RX FIFO Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t TXCMD:16;
                volatile uint32_t TXDATA:16;
            } B;
        } TXFR[4];              /* Transmit FIFO Registers */

        volatile uint32_t DSPI_reserved_txf[12];

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t RXDATA:16;
            } B;
        } RXFR[4];              /* Transmit FIFO Registers */

        volatile uint32_t DSPI_reserved_rxf[12];

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t MTOE:1;
                  volatile uint32_t:1;
                volatile uint32_t MTOCNT:6;
                  volatile uint32_t:4;
                volatile uint32_t TXSS:1;
                volatile uint32_t TPOL:1;
                volatile uint32_t TRRE:1;
                volatile uint32_t CID:1;
                volatile uint32_t DCONT:1;
                volatile uint32_t DSICTAS:3;
                  volatile uint32_t:6;
                volatile uint32_t DPCS5:1;
                volatile uint32_t DPCS4:1;
                volatile uint32_t DPCS3:1;
                volatile uint32_t DPCS2:1;
                volatile uint32_t DPCS1:1;
                volatile uint32_t DPCS0:1;
            } B;
        } DSICR;                /* DSI Configuration Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t SER_DATA:16;
            } B;
        } SDR;                  /* DSI Serialization Data Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t ASER_DATA:16;
            } B;
        } ASDR;                 /* DSI Alternate Serialization Data Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t COMP_DATA:16;
            } B;
        } COMPR;                /* DSI Transmit Comparison Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t DESER_DATA:16;
            } B;
        } DDR;                  /* DSI deserialization Data Register */

    };                          /* end of DSPI_tag */
/****************************************************************************/
/*                          MODULE : ECSM                                   */
/****************************************************************************/
    struct ECSM_tag {

        union {
            volatile uint16_t R;
        } PCT;                  /* ECSM Processor Core Type Register */

        union {
            volatile uint16_t R;
        } REV;                  /* ECSM  Revision Register */

