xwos/XWOS/xwcd/soc/powerpc/e200x/e200z0h/mpc560xb/mpc5604b.h
        int32_t ECSM_reserved1;

        union {
            volatile uint32_t R;
        } IMC;                  /* ECSM IPS Module Configuration Register */

        int8_t ECSM_reserved2[7];

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t ENBWCR:1;
                  volatile uint8_t:3;
                volatile uint8_t PRILVL:4;
            } B;
        } MWCR;                 /* ECSM Miscellaneous Wakeup Control Register */

        int32_t ECSM_reserved3[2];
        int8_t ECSM_reserved4[3];

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t FB0AI:1;
                volatile uint8_t FB0SI:1;
                volatile uint8_t FB1AI:1;
                volatile uint8_t FB1SI:1;
                  volatile uint8_t:4;
            } B;
        } MIR;                  /* ECSM Miscellaneous Interrupt Register */

        int32_t ECSM_reserved5;

        union {
            volatile uint32_t R;
        } MUDCR;                /* ECSM Miscellaneous User-Defined Control Register */

        int32_t ECSM_reserved6[6];      /* (0x040- 0x028)/4 = 0x06 */
        int8_t ECSM_reserved7[3];

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t:2;
                volatile uint8_t ER1BR:1;
                volatile uint8_t EF1BR:1;
                  volatile uint8_t:2;
                volatile uint8_t ERNCR:1;
                volatile uint8_t EFNCR:1;
            } B;
        } ECR;                  /* ECSM ECC Configuration Register */

        int8_t ECSM_reserved8[3];

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t:2;
                volatile uint8_t R1BC:1;
                volatile uint8_t F1BC:1;
                  volatile uint8_t:2;
                volatile uint8_t RNCE:1;
                volatile uint8_t FNCE:1;
            } B;
        } ESR;                  /* ECSM ECC Status Register */

        int16_t ECSM_reserved9;

        union {
            volatile uint16_t R;
            struct {
                volatile uint16_t:2;
                volatile uint16_t FRC1BI:1;
                volatile uint16_t FR11BI:1;
                  volatile uint16_t:2;
                volatile uint16_t FRCNCI:1;
                volatile uint16_t FR1NCI:1;
                  volatile uint16_t:1;
                volatile uint16_t ERRBIT:7;
            } B;
        } EEGR;                 /* ECSM ECC Error Generation Register */

        int32_t ECSM_reserved10;

        union {
            volatile uint32_t R;
        } FEAR;                 /* ECSM Flash ECC Address Register */

        int16_t ECSM_reserved11;

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t:4;
                volatile uint8_t FEMR:4;
            } B;
        } FEMR;                 /* ECSM Flash ECC Master Number Register */

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t WRITE:1;
                volatile uint8_t SIZE:3;
                volatile uint8_t PROTECTION:4;
            } B;
        } FEAT;                 /* ECSM Flash ECC Attributes Register */

        int32_t ECSM_reserved12;

        union {
            volatile uint32_t R;
        } FEDR;                 /* ECSM Flash ECC Data Register */

        union {
            volatile uint32_t R;
        } REAR;                 /* ECSM RAM ECC Address Register */

        int8_t ECSM_reserved13;

        union {
            volatile uint8_t R;
        } RESR;                 /* ECSM RAM ECC Address Register */

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t:4;
                volatile uint8_t REMR:4;
            } B;
        } REMR;                 /* ECSM RAM ECC Master Number Register */

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t WRITE:1;
                volatile uint8_t SIZE:3;
                volatile uint8_t PROTECTION:4;
            } B;
        } REAT;                 /* ECSM RAM ECC Attributes Register */

        int32_t ECSM_reserved14;

        union {
            volatile uint32_t R;
        } REDR;                 /* ECSM RAM ECC Data Register */

    };                          /* end of ECSM_tag */
/****************************************************************************/
/*                          MODULE : EMIOS                                  */
/****************************************************************************/
    struct EMIOS_CHANNEL_tag {
        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t CADR:16;
            } B;
        } CADR;                 /* Channel A Data Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t CBDR:16;
            } B;
        } CBDR;                 /* Channel B Data Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t CCNTR:16;
            } B;
        } CCNTR;                /* Channel Counter Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t FREN:1;
                volatile uint32_t ODIS:1;
                volatile uint32_t ODISSL:2;
                volatile uint32_t UCPRE:2;
                volatile uint32_t UCPEN:1;
                volatile uint32_t DMA:1;
                  volatile uint32_t:1;
                volatile uint32_t IF:4;
                volatile uint32_t FCK:1;
                volatile uint32_t FEN:1;
                  volatile uint32_t:3;
                volatile uint32_t FORCMA:1;
                volatile uint32_t FORCMB:1;
                  volatile uint32_t:1;
                volatile uint32_t BSL:2;
                volatile uint32_t EDSEL:1;
                volatile uint32_t EDPOL:1;
                volatile uint32_t MODE:7;
            } B;
        } CCR;                  /* Channel Control Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t OVR:1;
                  volatile uint32_t:15;
                volatile uint32_t OVFL:1;
                  volatile uint32_t:12;
                volatile uint32_t UCIN:1;
                volatile uint32_t UCOUT:1;
                volatile uint32_t FLAG:1;
            } B;
        } CSR;                  /* Channel Status Register */

        union {
            volatile uint32_t R;        /* Alternate Channel A Data Register */
        } ALTCADR;

