xwos/XWOS/xwcd/soc/powerpc/e200x/e200z0h/mpc560xb/mpc5604b.h
        uint32_t emios_channel_reserved[2];

    };                          /* end of EMIOS_CHANNEL_tag */

    struct EMIOS_tag {
        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:1;
                volatile uint32_t MDIS:1;
                volatile uint32_t FRZ:1;
                volatile uint32_t GTBE:1;
                volatile uint32_t ETB:1;
                volatile uint32_t GPREN:1;
                  volatile uint32_t:6;
                volatile uint32_t SRV:4;
                volatile uint32_t GPRE:8;
                  volatile uint32_t:8;
            } B;
        } MCR;                  /* Module Configuration Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:8;
                volatile uint32_t F23:1;
                volatile uint32_t F22:1;
                volatile uint32_t F21:1;
                volatile uint32_t F20:1;
                volatile uint32_t F19:1;
                volatile uint32_t F18:1;
                volatile uint32_t F17:1;
                volatile uint32_t F16:1;
                volatile uint32_t F15:1;
                volatile uint32_t F14:1;
                volatile uint32_t F13:1;
                volatile uint32_t F12:1;
                volatile uint32_t F11:1;
                volatile uint32_t F10:1;
                volatile uint32_t F9:1;
                volatile uint32_t F8:1;
                volatile uint32_t F7:1;
                volatile uint32_t F6:1;
                volatile uint32_t F5:1;
                volatile uint32_t F4:1;
                volatile uint32_t F3:1;
                volatile uint32_t F2:1;
                volatile uint32_t F1:1;
                volatile uint32_t F0:1;
            } B;
        } GFR;                  /* Global FLAG Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:8;
                volatile uint32_t OU23:1;
                volatile uint32_t OU22:1;
                volatile uint32_t OU21:1;
                volatile uint32_t OU20:1;
                volatile uint32_t OU19:1;
                volatile uint32_t OU18:1;
                volatile uint32_t OU17:1;
                volatile uint32_t OU16:1;
                volatile uint32_t OU15:1;
                volatile uint32_t OU14:1;
                volatile uint32_t OU13:1;
                volatile uint32_t OU12:1;
                volatile uint32_t OU11:1;
                volatile uint32_t OU10:1;
                volatile uint32_t OU9:1;
                volatile uint32_t OU8:1;
                volatile uint32_t OU7:1;
                volatile uint32_t OU6:1;
                volatile uint32_t OU5:1;
                volatile uint32_t OU4:1;
                volatile uint32_t OU3:1;
                volatile uint32_t OU2:1;
                volatile uint32_t OU1:1;
                volatile uint32_t OU0:1;
            } B;
        } OUDR;                 /* Output Update Disable Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:8;
                volatile uint32_t CHDIS23:1;
                volatile uint32_t CHDIS22:1;
                volatile uint32_t CHDIS21:1;
                volatile uint32_t CHDIS20:1;
                volatile uint32_t CHDIS19:1;
                volatile uint32_t CHDIS18:1;
                volatile uint32_t CHDIS17:1;
                volatile uint32_t CHDIS16:1;
                volatile uint32_t CHDIS15:1;
                volatile uint32_t CHDIS14:1;
                volatile uint32_t CHDIS13:1;
                volatile uint32_t CHDIS12:1;
                volatile uint32_t CHDIS11:1;
                volatile uint32_t CHDIS10:1;
                volatile uint32_t CHDIS9:1;
                volatile uint32_t CHDIS8:1;
                volatile uint32_t CHDIS7:1;
                volatile uint32_t CHDIS6:1;
                volatile uint32_t CHDIS5:1;
                volatile uint32_t CHDIS4:1;
                volatile uint32_t CHDIS3:1;
                volatile uint32_t CHDIS2:1;
                volatile uint32_t CHDIS1:1;
                volatile uint32_t CHDIS0:1;
            } B;
        } UCDIS;                /* Disable Channel Register */

        uint32_t emios_reserved1[4];

        struct EMIOS_CHANNEL_tag CH[28];

    };                          /* end of EMIOS_tag */
/****************************************************************************/
/*                          MODULE : FlexCAN                                */
/****************************************************************************/
    struct FLEXCAN_BUF_t {
        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:4;
                volatile uint32_t CODE:4;
                  volatile uint32_t:1;
                volatile uint32_t SRR:1;
                volatile uint32_t IDE:1;
                volatile uint32_t RTR:1;
                volatile uint32_t LENGTH:4;
                volatile uint32_t TIMESTAMP:16;
            } B;
        } CS;

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t PRIO:3;
                volatile uint32_t STD_ID:11;
                volatile uint32_t EXT_ID:18;
            } B;
        } ID;

        union {
            volatile uint8_t B[8];      /* Data buffer in Bytes (8 bits) */
            volatile uint16_t H[4];     /* Data buffer in Half-words (16 bits) */
            volatile uint32_t W[2];     /* Data buffer in words (32 bits) */
            volatile uint32_t R[2];     /* Data buffer in words (32 bits) */
        } DATA;

    };                          /* end of FLEXCAN_BUF_t */

    struct FLEXCAN_RXFIFO_t {
        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:9;
                volatile uint32_t SRR:1;
                volatile uint32_t IDE:1;
                volatile uint32_t RTR:1;
                volatile uint32_t LENGTH:4;
                volatile uint32_t TIMESTAMP:16;
            } B;
        } CS;

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:3;
                volatile uint32_t STD_ID:11;
                volatile uint32_t EXT_ID:18;
            } B;
        } ID;

        union {
            volatile uint8_t B[8];      /* Data buffer in Bytes (8 bits) */
            volatile uint16_t H[4];     /* Data buffer in Half-words (16 bits) */
            volatile uint32_t W[2];     /* Data buffer in words (32 bits) */
            volatile uint32_t R[2];     /* Data buffer in words (32 bits) */
        } DATA;

        uint32_t FLEXCAN_RXFIFO_reserved[20];   /* {0x00E0-0x0090}/0x4 = 0x14 */

        union {
            volatile uint32_t R;
        } IDTABLE[8];

