xwos/XWOS/xwcd/soc/powerpc/e200x/e200z0h/mpc560xb/mpc5604b.h
/****************************************************************************/
/* Use either Standard Buffer Structure OR RX FIFO and Buffer Structure     */
/****************************************************************************/
        /* Standard Buffer Structure */
        struct FLEXCAN_BUF_t BUF[64];

        /* RX FIFO and Buffer Structure */
        /*struct FLEXCAN_RXFIFO_t RXFIFO; */
        /*struct FLEXCAN_BUF_t BUF[56];   */
/****************************************************************************/

        uint32_t FLEXCAN_reserved3[256];        /* {0x0880-0x0480}/0x4 = 0x100 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t MI:32;
            } B;
        } RXIMR[64];            /* RX Individual Mask Registers */

    };                          /* end of FLEXCAN_tag */
/****************************************************************************/
/*                          MODULE : i2c                                    */
/****************************************************************************/
    struct I2C_tag {
        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t ADR:7;
                  volatile uint8_t:1;
            } B;
        } IBAD;                 /* Module Bus Address Register */

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t IBC:8;
            } B;
        } IBFD;                 /* Module Bus Frequency Register */

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t MDIS:1;
                volatile uint8_t IBIE:1;
                volatile uint8_t MS:1;
                volatile uint8_t TX:1;
                volatile uint8_t NOACK:1;
                volatile uint8_t RSTA:1;
                volatile uint8_t DMAEN:1;
                volatile uint8_t IBDOZE:1;
            } B;
        } IBCR;                 /* Module Bus Control Register */

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t TCF:1;
                volatile uint8_t IAAS:1;
                volatile uint8_t IBB:1;
                volatile uint8_t IBAL:1;
                  volatile uint8_t:1;
                volatile uint8_t SRW:1;
                volatile uint8_t IBIF:1;
                volatile uint8_t RXAK:1;
            } B;
        } IBSR;                 /* Module Status Register */

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t DATA:8;
            } B;
        } IBDR;                 /* Module Data Register */

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t BIIE:1;
                  volatile uint8_t:7;
            } B;
        } IBIC;                 /* Module Interrupt Configuration Register */

    };                          /* end of I2C_tag */
/****************************************************************************/
/*                          MODULE : INTC                                   */
/****************************************************************************/
    struct INTC_tag {
        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:26;
                volatile uint32_t VTES:1;
                  volatile uint32_t:4;
                volatile uint32_t HVEN:1;
            } B;
        } MCR;                  /* Module Configuration Register */

        int32_t INTC_reserved1; /* (0x008 - 0x004)/4 = 0x01 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:28;
                volatile uint32_t PRI:4;
            } B;
        } CPR;                  /* Current Priority Register */

        int32_t INTC_reserved2; /* (0x010 - 0x00C)/4 = 0x01 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t VTBA:21;
                volatile uint32_t INTVEC:9;
                  volatile uint32_t:2;
            } B;
        } IACKR;                /* Interrupt Acknowledge Register */

        int32_t INTC_reserved3; /* (0x018 - 0x014)/4 = 0x01 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:32;
            } B;
        } EOIR;                 /* End of Interrupt Register */

        int32_t INTC_reserved4; /* (0x020 - 0x01C)/4 = 0x01 */

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t:6;
                volatile uint8_t SET:1;
                volatile uint8_t CLR:1;
            } B;
        } SSCIR[8];             /* Software Set/Clear Interruput Register */

        uint32_t intc_reserved5[6];     /* (0x040 - 0x028)/4 = 0x06 */

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t:4;
                volatile uint8_t PRI:4;
            } B;
        } PSR[512];             /* Software Set/Clear Interrupt Register */

    };                          /* end of INTC_tag */
/****************************************************************************/
/*                          MODULE : LINFLEX                                */
/****************************************************************************/

    struct LINFLEX_tag {

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t CCD:1;
                volatile uint32_t CFD:1;
                volatile uint32_t LASE:1;
                volatile uint32_t AWUM:1;
                volatile uint32_t MBL:4;
                volatile uint32_t BF:1;
                volatile uint32_t SLFM:1;
                volatile uint32_t LBKM:1;
                volatile uint32_t MME:1;
                volatile uint32_t SBDT:1;
                volatile uint32_t RBLM:1;
                volatile uint32_t SLEEP:1;
                volatile uint32_t INIT:1;
            } B;
        } LINCR1;               /* LINFLEX LIN Control Register 1 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t SZIE:1;
                volatile uint32_t OCIE:1;
                volatile uint32_t BEIE:1;
                volatile uint32_t CEIE:1;
                volatile uint32_t HEIE:1;
                  volatile uint32_t:2;
                volatile uint32_t FEIE:1;
                volatile uint32_t BOIE:1;
                volatile uint32_t LSIE:1;
                volatile uint32_t WUIE:1;
                volatile uint32_t DBFIE:1;
                volatile uint32_t DBEIE:1;
                volatile uint32_t DRIE:1;
                volatile uint32_t DTIE:1;
                volatile uint32_t HRIE:1;
            } B;
        } LINIER;               /* LINFLEX LIN Interrupt Enable Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t LINS:4;
                  volatile uint32_t:2;
                volatile uint32_t RMB:1;
                  volatile uint32_t:1;
                volatile uint32_t RBSY:1;
                volatile uint32_t RPS:1;
                volatile uint32_t WUF:1;
                volatile uint32_t DBFF:1;
                volatile uint32_t DBEF:1;
                volatile uint32_t DRF:1;
                volatile uint32_t DTF:1;
                volatile uint32_t HRF:1;
            } B;
        } LINSR;                /* LINFLEX LIN Status Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t SZF:1;
                volatile uint32_t OCF:1;
                volatile uint32_t BEF:1;
                volatile uint32_t CEF:1;
                volatile uint32_t SFEF:1;
                volatile uint32_t SDEF:1;
                volatile uint32_t IDPEF:1;
                volatile uint32_t FEF:1;
                volatile uint32_t BOF:1;
                  volatile uint32_t:6;
                volatile uint32_t NF:1;
            } B;
        } LINESR;               /* LINFLEX LIN Error Status Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t:1;
                volatile uint32_t TDFL:2;
                  volatile uint32_t:1;
                volatile uint32_t RDFL:2;
                  volatile uint32_t:4;
                volatile uint32_t RXEN:1;
                volatile uint32_t TXEN:1;
                volatile uint32_t OP:1;
                volatile uint32_t PCE:1;
                volatile uint32_t WL:1;
                volatile uint32_t UART:1;
            } B;
        } UARTCR;               /* LINFLEX UART Mode Control Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t SZF:1;
                volatile uint32_t OCF:1;
                volatile uint32_t PE:4;
                volatile uint32_t RMB:1;
                volatile uint32_t FEF:1;
                volatile uint32_t BOF:1;
                volatile uint32_t RPS:1;
                volatile uint32_t WUF:1;
                  volatile uint32_t:2;
                volatile uint32_t DRF:1;
                volatile uint32_t DTF:1;
                volatile uint32_t NF:1;
            } B;
        } UARTSR;               /* LINFLEX UART Mode Status Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t:5;
                volatile uint32_t LTOM:1;
                volatile uint32_t IOT:1;
                volatile uint32_t TOCE:1;
                volatile uint32_t CNT:8;
            } B;
        } LINTCSR;              /* LINFLEX LIN Time-Out Control Status Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t OC2:8;
                volatile uint32_t OC1:8;
            } B;
        } LINOCR;               /* LINFLEX LIN Output Compare Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t:4;
                volatile uint32_t RTO:4;
                  volatile uint32_t:1;
                volatile uint32_t HTO:7;
            } B;
        } LINTOCR;              /* LINFLEX LIN Output Compare Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t:12;
                volatile uint32_t DIV_F:4;
            } B;
        } LINFBRR;              /* LINFLEX LIN Fractional Baud Rate Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t:3;
                volatile uint32_t DIV_M:13;
            } B;
        } LINIBRR;              /* LINFLEX LIN Integer Baud Rate Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t:8;
                volatile uint32_t CF:8;
            } B;
        } LINCFR;               /* LINFLEX LIN Checksum Field Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t:1;
                volatile uint32_t IOBE:1;
                volatile uint32_t IOPE:1;
                volatile uint32_t WURQ:1;
                volatile uint32_t DDRQ:1;
                volatile uint32_t DTRQ:1;
                volatile uint32_t ABRQ:1;
                volatile uint32_t HTRQ:1;
                  volatile uint32_t:8;
            } B;
        } LINCR2;               /* LINFLEX LIN Control Register 2 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t DFL:6;
                volatile uint32_t DIR:1;
                volatile uint32_t CCS:1;
                  volatile uint32_t:2;
                volatile uint32_t ID:6;
            } B;
        } BIDR;                 /* LINFLEX Buffer Identifier Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t DATA3:8;
                volatile uint32_t DATA2:8;
                volatile uint32_t DATA1:8;
                volatile uint32_t DATA0:8;
            } B;
        } BDRL;                 /* LINFLEX Buffer Data Register Least Significant */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t DATA7:8;
                volatile uint32_t DATA6:8;
                volatile uint32_t DATA5:8;
                volatile uint32_t DATA4:8;
            } B;
        } BDRM;                 /* LINFLEX Buffer Data Register Most Significant */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t:8;
                volatile uint32_t FACT:8;
            } B;
        } IFER;                 /* LINFLEX Identifier Filter Enable Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t:12;
                volatile uint32_t IFMI:4;
            } B;
        } IFMI;                 /* LINFLEX Identifier Filter Match Index Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t:12;
                volatile uint32_t IFM:4;
            } B;
        } IFMR;                 /* LINFLEX Identifier Filter Mode Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t:3;
                volatile uint32_t DFL:3;
                volatile uint32_t DIR:1;
                volatile uint32_t CCS:1;
                  volatile uint32_t:2;
                volatile uint32_t ID:6;
            } B;
        } IFCR[16];             /* LINFLEX Identifier Filter Control Register 0-15 */

