xwos/XWOS/xwcd/soc/powerpc/e200x/e200z0h/mpc560xb/mpc5604b.h
    };                          /* end of LINFLEX_tag */
/****************************************************************************/
/*                          MODULE : ME                                   */
/****************************************************************************/
    struct ME_tag {

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t S_CURRENTMODE:4;
                volatile uint32_t S_MTRANS:1;
                volatile uint32_t S_DC:1;
                  volatile uint32_t:2;
                volatile uint32_t S_PDO:1;
                  volatile uint32_t:2;
                volatile uint32_t S_MVR:1;
                volatile uint32_t S_DFLA:2;
                volatile uint32_t S_CFLA:2;
                  volatile uint32_t:9;
                volatile uint32_t S_FMPLL:1;
                volatile uint32_t S_FXOSC:1;
                volatile uint32_t S_FIRC:1;
                volatile uint32_t S_SYSCLK:4;
            } B;
        } GS;                   /* Global Status Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t TARGET_MODE:4;
                  volatile uint32_t:12;
                volatile uint32_t KEY:16;
            } B;
        } MCTL;                 /* Mode Control Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:18;
                volatile uint32_t STANDBY0:1;
                  volatile uint32_t:2;
                volatile uint32_t STOP0:1;
                  volatile uint32_t:1;
                volatile uint32_t HALT0:1;
                volatile uint32_t RUN3:1;
                volatile uint32_t RUN2:1;
                volatile uint32_t RUN1:1;
                volatile uint32_t RUN0:1;
                volatile uint32_t DRUN:1;
                volatile uint32_t SAFE:1;
                volatile uint32_t TEST:1;
                volatile uint32_t RESET:1;
            } B;
        } MER;                  /* Mode Enable Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:28;
                volatile uint32_t I_CONF:1;
                volatile uint32_t I_MODE:1;
                volatile uint32_t I_SAFE:1;
                volatile uint32_t I_MTC:1;
            } B;
        } IS;                   /* Interrupt Status Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:28;
                volatile uint32_t M_CONF:1;
                volatile uint32_t M_MODE:1;
                volatile uint32_t M_SAFE:1;
                volatile uint32_t M_MTC:1;
            } B;
        } IM;                   /* Interrupt Mask Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:27;
                volatile uint32_t S_MTI:1;
                volatile uint32_t S_MRI:1;
                volatile uint32_t S_DMA:1;
                volatile uint32_t S_NMA:1;
                volatile uint32_t S_SEA:1;
            } B;
        } IMTS;                 /* Invalid Mode Transition Status Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:8;
                volatile uint32_t MPH_BUSY:1;
                  volatile uint32_t:2;
                volatile uint32_t PMC_PROG:1;
                volatile uint32_t CORE_DBG:1;
                  volatile uint32_t:2;
                volatile uint32_t SMR:1;
                  volatile uint32_t:1;
                volatile uint32_t FMPLL_SC:1;
                volatile uint32_t FXOSC_SC:1;
                volatile uint32_t FIRC_SC:1;
                  volatile uint32_t:1;
                volatile uint32_t SYSCLK_SW:1;
                volatile uint32_t DFLASH_SC:1;
                volatile uint32_t CFLASH_SC:1;
                volatile uint32_t CDP_PRPH_0_143:1;
                  volatile uint32_t:3;
                volatile uint32_t CDP_PRPH_96_127:1;
                volatile uint32_t CDP_PRPH_64_95:1;
                volatile uint32_t CDP_PRPH_32_63:1;
                volatile uint32_t CDP_PRPH_0_31:1;
            } B;
        } DMTS;                 /* Invalid Mode Transition Status Register */

        int32_t ME_reserved0;

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:8;
                volatile uint32_t PDO:1;
                  volatile uint32_t:2;
                volatile uint32_t MVRON:1;
                volatile uint32_t DFLAON:2;
                volatile uint32_t CFLAON:2;
                  volatile uint32_t:9;
                volatile uint32_t FMPLLON:1;
                volatile uint32_t FXOSCON:1;
                volatile uint32_t FIRCON:1;
                volatile uint32_t SYSCLK:4;
            } B;
        } RESET;                /* Reset Mode Configuration Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:8;
                volatile uint32_t PDO:1;
                  volatile uint32_t:2;
                volatile uint32_t MVRON:1;
                volatile uint32_t DFLAON:2;
                volatile uint32_t CFLAON:2;
                  volatile uint32_t:9;
                volatile uint32_t FMPLLON:1;
                volatile uint32_t FXOSCON:1;
                volatile uint32_t FIRCON:1;
                volatile uint32_t SYSCLK:4;
            } B;
        } TEST;                 /* Test Mode Configuration Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:8;
                volatile uint32_t PDO:1;
                  volatile uint32_t:2;
                volatile uint32_t MVRON:1;
                volatile uint32_t DFLAON:2;
                volatile uint32_t CFLAON:2;
                  volatile uint32_t:9;
                volatile uint32_t FMPLLON:1;
                volatile uint32_t FXOSCON:1;
                volatile uint32_t FIRCON:1;
                volatile uint32_t SYSCLK:4;
            } B;
        } SAFE;                 /* Safe Mode Configuration Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:8;
                volatile uint32_t PDO:1;
                  volatile uint32_t:2;
                volatile uint32_t MVRON:1;
                volatile uint32_t DFLAON:2;
                volatile uint32_t CFLAON:2;
                  volatile uint32_t:9;
                volatile uint32_t FMPLLON:1;
                volatile uint32_t FXOSCON:1;
                volatile uint32_t FIRCON:1;
                volatile uint32_t SYSCLK:4;
            } B;
        } DRUN;                 /* DRUN Mode Configuration Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:8;
                volatile uint32_t PDO:1;
                  volatile uint32_t:2;
                volatile uint32_t MVRON:1;
                volatile uint32_t DFLAON:2;
                volatile uint32_t CFLAON:2;
                  volatile uint32_t:9;
                volatile uint32_t FMPLLON:1;
                volatile uint32_t FXOSCON:1;
                volatile uint32_t FIRCON:1;
                volatile uint32_t SYSCLK:4;
            } B;
        } RUN[4];               /* RUN 0->4 Mode Configuration Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:8;
                volatile uint32_t PDO:1;
                  volatile uint32_t:2;
                volatile uint32_t MVRON:1;
                volatile uint32_t DFLAON:2;
                volatile uint32_t CFLAON:2;
                  volatile uint32_t:9;
                volatile uint32_t FMPLLON:1;
                volatile uint32_t FXOSCON:1;
                volatile uint32_t FIRCON:1;
                volatile uint32_t SYSCLK:4;
            } B;
        } HALT0;                /* HALT0 Mode Configuration Register */

        int32_t ME_reserved1;

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:8;
                volatile uint32_t PDO:1;
                  volatile uint32_t:2;
                volatile uint32_t MVRON:1;
                volatile uint32_t DFLAON:2;
                volatile uint32_t CFLAON:2;
                  volatile uint32_t:9;
                volatile uint32_t FMPLLON:1;
                volatile uint32_t FXOSCON:1;
                volatile uint32_t FIRCON:1;
                volatile uint32_t SYSCLK:4;
            } B;
        } STOP0;                /* STOP0 Mode Configuration Register */

        int32_t ME_reserved2[2];

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:8;
                volatile uint32_t PDO:1;
                  volatile uint32_t:2;
                volatile uint32_t MVRON:1;
                volatile uint32_t DFLAON:2;
                volatile uint32_t CFLAON:2;
                  volatile uint32_t:9;
                volatile uint32_t FMPLLON:1;
                volatile uint32_t FXOSCON:1;
                volatile uint32_t FIRCON:1;
                volatile uint32_t SYSCLK:4;
            } B;
        } STANDBY0;             /* STANDBY0 Mode Configuration Register */

        int32_t ME_reserved3[2];

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:10;
                volatile uint32_t S_FLEXCAN5:1;
                volatile uint32_t S_FLEXCAN4:1;
                volatile uint32_t S_FLEXCAN3:1;
                volatile uint32_t S_FLEXCAN2:1;
                volatile uint32_t S_FLEXCAN1:1;
                volatile uint32_t S_FLEXCAN0:1;
                  volatile uint32_t:9;
                volatile uint32_t S_DSPI2:1;
                volatile uint32_t S_DSPI1:1;
                volatile uint32_t S_DSPI0:1;
                  volatile uint32_t:4;
            } B;
        } PS0;                  /* Peripheral Status Register 0 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:3;
                volatile uint32_t S_CANSAMPLER:1;
                  volatile uint32_t:2;
                volatile uint32_t S_CTU:1;
                  volatile uint32_t:5;
                volatile uint32_t S_LINFLEX3:1;
                volatile uint32_t S_LINFLEX2:1;
                volatile uint32_t S_LINFLEX1:1;
                volatile uint32_t S_LINFLEX0:1;
                  volatile uint32_t:3;
                volatile uint32_t S_I2C:1;
                  volatile uint32_t:11;
                volatile uint32_t S_ADC:1;
            } B;
        } PS1;                  /* Peripheral Status Register 1 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:3;
                volatile uint32_t S_PIT_RTI:1;
                volatile uint32_t S_RTC_API:1;
                  volatile uint32_t:18;
                volatile uint32_t S_EMIOS:1;
                  volatile uint32_t:2;
                volatile uint32_t S_WKUP:1;
                volatile uint32_t S_SIU:1;
                  volatile uint32_t:4;
            } B;
        } PS2;                  /* Peripheral Status Register 2 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:23;
                volatile uint32_t S_CMU:1;
                  volatile uint32_t:8;
            } B;
        } PS3;                  /* Peripheral Status Register 3 */

        int32_t ME_reserved4[4];

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:24;
                volatile uint32_t RUN3:1;
                volatile uint32_t RUN2:1;
                volatile uint32_t RUN1:1;
                volatile uint32_t RUN0:1;
                volatile uint32_t DRUN:1;
                volatile uint32_t SAFE:1;
                volatile uint32_t TEST:1;
                volatile uint32_t RESET:1;
            } B;
        } RUNPC[8];             /* RUN Peripheral Configuration 0->7 Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:18;
                volatile uint32_t STANDBY0:1;
                  volatile uint32_t:2;
                volatile uint32_t STOP0:1;
                  volatile uint32_t:1;
                volatile uint32_t HALT0:1;
                  volatile uint32_t:8;
            } B;
        } LPPC[8];              /* Low Power Peripheral Configuration 0->7 Register */

        union {
            volatile uint8_t R;
            struct {
                volatile uint8_t:1;
                volatile uint8_t DBG_F:1;
                volatile uint8_t LP_CFG:3;
                volatile uint8_t RUN_CFG:3;
            } B;
        } PCTL[144];            /* Peripheral Control 0->143 Register */

    };                          /* end of ME_tag */
/****************************************************************************/
/*                          MODULE : MPU                                    */
/****************************************************************************/
    struct MPU_tag {
        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t SPERR:8;
                  volatile uint32_t:4;
                volatile uint32_t HRL:4;
                volatile uint32_t NSP:4;
                volatile uint32_t NGRD:4;
                  volatile uint32_t:7;
                volatile uint32_t VLD:1;
            } B;
        } CESR;                 /* Module Control/Error Status Register */

        uint32_t mpu_reserved1[3];      /* (0x010 - 0x004)/4 = 0x03 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t EADDR:32;
            } B;
        } EAR0;

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t EACD:16;
                volatile uint32_t EPID:8;
                volatile uint32_t EMN:4;
                volatile uint32_t EATTR:3;
                volatile uint32_t ERW:1;
            } B;
        } EDR0;

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t EADDR:32;
            } B;
        } EAR1;

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t EACD:16;
                volatile uint32_t EPID:8;
                volatile uint32_t EMN:4;
                volatile uint32_t EATTR:3;
                volatile uint32_t ERW:1;
            } B;
        } EDR1;

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t EADDR:32;
            } B;
        } EAR2;

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t EACD:16;
                volatile uint32_t EPID:8;
                volatile uint32_t EMN:4;
                volatile uint32_t EATTR:3;
                volatile uint32_t ERW:1;
            } B;
        } EDR2;

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t EADDR:32;
            } B;
        } EAR3;

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t EACD:16;
                volatile uint32_t EPID:8;
                volatile uint32_t EMN:4;
                volatile uint32_t EATTR:3;
                volatile uint32_t ERW:1;
            } B;
        } EDR3;

        uint32_t mpu_reserved2[244];    /* (0x0400 - 0x0030)/4 = 0x0F4 */

