xwos/XWOS/xwcd/soc/powerpc/e200x/e200z0h/mpc560xb/mpc5604b.h
        struct {
            union {
                volatile uint32_t R;
                struct {
                    volatile uint32_t SRTADDR:27;
                      volatile uint32_t:5;
                } B;
            } WORD0;            /* Region Descriptor n Word 0 */

            union {
                volatile uint32_t R;
                struct {
                    volatile uint32_t ENDADDR:27;
                      volatile uint32_t:5;
                } B;
            } WORD1;            /* Region Descriptor n Word 1 */

            union {
                volatile uint32_t R;
                struct {
                    volatile uint32_t M7RE:1;
                    volatile uint32_t M7WE:1;
                    volatile uint32_t M6RE:1;
                    volatile uint32_t M6WE:1;
                    volatile uint32_t M5RE:1;
                    volatile uint32_t M5WE:1;
                    volatile uint32_t M4RE:1;
                    volatile uint32_t M4WE:1;
                    volatile uint32_t M3PE:1;
                    volatile uint32_t M3SM:2;
                    volatile uint32_t M3UM:3;
                    volatile uint32_t M2PE:1;
                    volatile uint32_t M2SM:2;
                    volatile uint32_t M2UM:3;
                    volatile uint32_t M1PE:1;
                    volatile uint32_t M1SM:2;
                    volatile uint32_t M1UM:3;
                    volatile uint32_t M0PE:1;
                    volatile uint32_t M0SM:2;
                    volatile uint32_t M0UM:3;
                } B;
            } WORD2;            /* Region Descriptor n Word 2 */

            union {
                volatile uint32_t R;
                struct {
                    volatile uint32_t PID:8;
                    volatile uint32_t PIDMASK:8;
                      volatile uint32_t:15;
                    volatile uint32_t VLD:1;
                } B;
            } WORD3;            /* Region Descriptor n Word 3 */

        } RGD[16];

        uint32_t mpu_reserved3[192];    /* (0x0800 - 0x0500)/4 = 0x0C0 */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t M7RE:1;
                volatile uint32_t M7WE:1;
                volatile uint32_t M6RE:1;
                volatile uint32_t M6WE:1;
                volatile uint32_t M5RE:1;
                volatile uint32_t M5WE:1;
                volatile uint32_t M4RE:1;
                volatile uint32_t M4WE:1;
                volatile uint32_t M3PE:1;
                volatile uint32_t M3SM:2;
                volatile uint32_t M3UM:3;
                volatile uint32_t M2PE:1;
                volatile uint32_t M2SM:2;
                volatile uint32_t M2UM:3;
                volatile uint32_t M1PE:1;
                volatile uint32_t M1SM:2;
                volatile uint32_t M1UM:3;
                volatile uint32_t M0PE:1;
                volatile uint32_t M0SM:2;
                volatile uint32_t M0UM:3;
            } B;
        } RGDAAC[16];           /* Region Descriptor Alternate Access Control n */

    };                          /* end of MPU_tag */
/****************************************************************************/
/*                          MODULE : PCU                                   */
/****************************************************************************/
    struct PCU_tag {

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:18;
                volatile uint32_t STBY0:1;
                  volatile uint32_t:2;
                volatile uint32_t STOP0:1;
                  volatile uint32_t:1;
                volatile uint32_t HALT0:1;
                volatile uint32_t RUN3:1;
                volatile uint32_t RUN2:1;
                volatile uint32_t RUN1:1;
                volatile uint32_t RUN0:1;
                volatile uint32_t DRUN:1;
                volatile uint32_t SAFE:1;
                volatile uint32_t TEST:1;
                volatile uint32_t RST:1;
            } B;
        } PCONF[3];             /* Power domain 0-2 configuration register */

        int32_t PCU_reserved0[13];      /* (0x040 - 0x00C)/4 = 0x0D */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:29;
                volatile uint32_t PD2:1;
                volatile uint32_t PD1:1;
                volatile uint32_t PD0:1;
            } B;
        } PSTAT;                /* Power Domain Status Register */

        int32_t PCU_reserved1[15];      /* {0x0080-0x0044}/0x4 = 0xF */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:15;
                volatile uint32_t MASK_LVDHV5:1;
            } B;
        } VCTL;                 /* Voltage Regulator Control Register */

    };                          /* end of PCU_tag */
/****************************************************************************/
/*                          MODULE : pit                                    */
/****************************************************************************/
    struct PIT_tag {
        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:30;
                volatile uint32_t MDIS:1;
                volatile uint32_t FRZ:1;
            } B;
        } PITMCR;

        uint32_t pit_reserved1[63];     /* (0x0100 - 0x0004)/4 = 0x3F */

        struct {
            union {
                volatile uint32_t R;
                struct {
                    volatile uint32_t TSV:32;
                } B;
            } LDVAL;

            union {
                volatile uint32_t R;
                struct {
                    volatile uint32_t TVL:32;
                } B;
            } CVAL;

            union {
                volatile uint32_t R;
                struct {
                    volatile uint32_t:30;
                    volatile uint32_t TIE:1;
                    volatile uint32_t TEN:1;
                } B;
            } TCTRL;

            union {
                volatile uint32_t R;
                struct {
                    volatile uint32_t:31;
                    volatile uint32_t TIF:1;
                } B;
            } TFLG;
        } CH[6];

    };                          /* end of PIT_tag */
/****************************************************************************/
/*                          MODULE : RGM                                   */
/****************************************************************************/
    struct RGM_tag {

        union {
            volatile uint16_t R;
            struct {
                volatile uint16_t F_EXR:1;
                  volatile uint16_t:6;
                volatile uint16_t F_FLASH:1;
                volatile uint16_t F_LVD45:1;
                volatile uint16_t F_CMU_FHL:1;
                volatile uint16_t F_CMU_OLR:1;
                volatile uint16_t F_FMPLL:1;
                volatile uint16_t F_CHKSTOP:1;
                volatile uint16_t F_SOFT:1;
                volatile uint16_t F_CORE:1;
                volatile uint16_t F_JTAG:1;
            } B;
        } FES;                  /* Functional Event Status */

        union {
            volatile uint16_t R;
            struct {
                volatile uint16_t F_POR:1;
                  volatile uint16_t:11;
                volatile uint16_t F_LVD27:1;
                volatile uint16_t F_SWT:1;
                volatile uint16_t F_LVD12_PD1:1;
                volatile uint16_t F_LVD12_PD0:1;
            } B;
        } DES;                  /* Destructive Event Status */

        union {
            volatile uint16_t R;
            struct {
                volatile uint16_t D_EXR:1;
                  volatile uint16_t:6;
                volatile uint16_t D_FLASH:1;
                volatile uint16_t D_LVD45:1;
                volatile uint16_t D_CMU_FHL:1;
                volatile uint16_t D_CMU_OLR:1;
                volatile uint16_t D_FMPLL:1;
                volatile uint16_t D_CHKSTOP:1;
                volatile uint16_t D_SOFT:1;
                volatile uint16_t D_CORE:1;
                volatile uint16_t D_JTAG:1;
            } B;
        } FERD;                 /* Functional Event Reset Disable */

        union {
            volatile uint16_t R;
            struct {
                volatile uint16_t D_POR:1;
                  volatile uint16_t:11;
                volatile uint16_t D_LVD27:1;
                volatile uint16_t D_SWT:1;
                volatile uint16_t D_LVD12_PD1:1;
                volatile uint16_t D_LVD12_PD0:1;
            } B;
        } DERD;                 /* Destructive Event Reset Disable */

        int16_t RGM_reserved0[4];

        union {
            volatile uint16_t R;
            struct {
                volatile uint16_t AR_EXR:1;
                  volatile uint16_t:6;
                volatile uint16_t AR_FLASH:1;
                volatile uint16_t AR_LVD45:1;
                volatile uint16_t AR_CMU_FHL:1;
                volatile uint16_t AR_CMU_OLR:1;
                volatile uint16_t AR_FMPLL:1;
                volatile uint16_t AR_CHKSTOP:1;
                volatile uint16_t AR_SOFT:1;
                volatile uint16_t AR_CORE:1;
                volatile uint16_t AR_JTAG:1;
            } B;
        } FEAR;                 /* Functional Event Alternate Request */

        union {
            volatile uint16_t R;
            struct {
                volatile uint16_t:12;
                volatile uint16_t AR_LVD27:1;
                volatile uint16_t AR_SWT:1;
                volatile uint16_t AR_LVD12_PD1:1;
                volatile uint16_t AR_LVD12_PD0:1;
            } B;
        } DEAR;                 /* Destructive Event Alternate Request */

        int16_t RGM_reserved1[2];

        union {
            volatile uint16_t R;
            struct {
                volatile uint16_t:8;
                volatile uint16_t SS_LVD45:1;
                volatile uint16_t SS_CMU_FHL:1;
                volatile uint16_t SS_CMU_OLR:1;
                volatile uint16_t SS_PLL:1;
                volatile uint16_t SS_CHKSTOP:1;
                volatile uint16_t SS_SOFT:1;
                volatile uint16_t SS_CORE:1;
                volatile uint16_t SS_JTAG:1;
            } B;
        } FESS;                 /* Functional Event Short Sequence */

        union {
            volatile uint16_t R;
            struct {
                volatile uint16_t:8;
                volatile uint16_t BOOT_FROM_BKP_RAM:1;
                  volatile uint16_t:7;
            } B;
        } STDBY;                /* STANDBY reset sequence */

        union {
            volatile uint16_t R;
            struct {
                volatile uint16_t BE_EXR:1;
                  volatile uint16_t:6;
                volatile uint16_t BE_FLASH:1;
                volatile uint16_t BE_LVD45:1;
                volatile uint16_t BE_CMU_FHL:1;
                volatile uint16_t BE_CMU_OLR:1;
                volatile uint16_t BE_FMPLL:1;
                volatile uint16_t BE_CHKSTOP:1;
                volatile uint16_t BE_SOFT:1;
                volatile uint16_t BE_CORE:1;
                volatile uint16_t BE_JTAG:1;
            } B;
        } FBRE;                 /* Functional Bidirectional Reset Enable */

