xwos/XWOS/xwcd/soc/powerpc/e200x/e200z0h/mpc560xb/mpc5604b.h
    };                          /* end of RGM_tag */
/****************************************************************************/
/*                          MODULE : RTC                                   */
/****************************************************************************/
    struct RTC_tag {
        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t SUPV:1;
                  volatile uint32_t:31;
            } B;
        } RTCSUPV;              /* RTC Supervisor Control Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t CNTEN:1;
                volatile uint32_t RTCIE:1;
                volatile uint32_t FRZEN:1;
                volatile uint32_t ROVREN:1;
                volatile uint32_t RTCVAL:12;
                volatile uint32_t APIEN:1;
                volatile uint32_t APIIE:1;
                volatile uint32_t CLKSEL:2;
                volatile uint32_t DIV512EN:1;
                volatile uint32_t DIV32EN:1;
                volatile uint32_t APIVAL:10;
            } B;
        } RTCC;                 /* RTC Control Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:2;
                volatile uint32_t RTCF:1;
                  volatile uint32_t:15;
                volatile uint32_t APIF:1;
                  volatile uint32_t:2;
                volatile uint32_t ROVRF:1;
                  volatile uint32_t:10;
            } B;
        } RTCS;                 /* RTC Status Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t RTCCNT:32;
            } B;
        } RTCCNT;               /* RTC Counter Register */

    };                          /* end of RTC_tag */
/****************************************************************************/
/*                     MODULE : SIU                                         */
/****************************************************************************/
    struct SIU_tag {

        int32_t SIU_reserved0;  /* {0x004-0x000}/4 = 0x01 */

        union {                 /* MCU ID Register 1 */
            volatile uint32_t R;
            struct {
                volatile uint32_t PARTNUM:16;
                volatile uint32_t CSP:1;
                volatile uint32_t PKG:5;
                  volatile uint32_t:2;
                volatile uint32_t MAJOR_MASK:4;
                volatile uint32_t MINOR_MASK:4;
            } B;
        } MIDR;

        union {                 /* MCU ID Register 2 */
            volatile uint32_t R;
            struct {
                volatile uint32_t SF:1;
                volatile uint32_t FLASH_SIZE_1:4;
                volatile uint32_t FLASH_SIZE_2:4;
                  volatile uint32_t:7;
                volatile uint32_t PARTNUM:8;
                  volatile uint32_t:3;
                volatile uint32_t EE:1;
                  volatile uint32_t:4;
            } B;
        } MIDR2;

        int32_t SIU_reserved1[2];       /* {0x014-0x00C}/4 = 0x02 */

        union {                 /* Interrupt Status Flag Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t EIF15:1;
                volatile uint32_t EIF14:1;
                volatile uint32_t EIF13:1;
                volatile uint32_t EIF12:1;
                volatile uint32_t EIF11:1;
                volatile uint32_t EIF10:1;
                volatile uint32_t EIF9:1;
                volatile uint32_t EIF8:1;
                volatile uint32_t EIF7:1;
                volatile uint32_t EIF6:1;
                volatile uint32_t EIF5:1;
                volatile uint32_t EIF4:1;
                volatile uint32_t EIF3:1;
                volatile uint32_t EIF2:1;
                volatile uint32_t EIF1:1;
                volatile uint32_t EIF0:1;
            } B;
        } ISR;

        union {                 /* Interrupt Request Enable Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t EIRE15:1;
                volatile uint32_t EIRE14:1;
                volatile uint32_t EIRE13:1;
                volatile uint32_t EIRE12:1;
                volatile uint32_t EIRE11:1;
                volatile uint32_t EIRE10:1;
                volatile uint32_t EIRE9:1;
                volatile uint32_t EIRE8:1;
                volatile uint32_t EIRE7:1;
                volatile uint32_t EIRE6:1;
                volatile uint32_t EIRE5:1;
                volatile uint32_t EIRE4:1;
                volatile uint32_t EIRE3:1;
                volatile uint32_t EIRE2:1;
                volatile uint32_t EIRE1:1;
                volatile uint32_t EIRE0:1;
            } B;
        } IRER;

        int32_t SIU_reserved2[3];       /* {0x028-0x01C}/4 = 0x03 */

        union {                 /* Interrupt Rising-Edge Event Enable Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t IREE15:1;
                volatile uint32_t IREE14:1;
                volatile uint32_t IREE13:1;
                volatile uint32_t IREE12:1;
                volatile uint32_t IREE11:1;
                volatile uint32_t IREE10:1;
                volatile uint32_t IREE9:1;
                volatile uint32_t IREE8:1;
                volatile uint32_t IREE7:1;
                volatile uint32_t IREE6:1;
                volatile uint32_t IREE5:1;
                volatile uint32_t IREE4:1;
                volatile uint32_t IREE3:1;
                volatile uint32_t IREE2:1;
                volatile uint32_t IREE1:1;
                volatile uint32_t IREE0:1;
            } B;
        } IREER;

        union {                 /* Interrupt Falling-Edge Event Enable Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t IFEE15:1;
                volatile uint32_t IFEE14:1;
                volatile uint32_t IFEE13:1;
                volatile uint32_t IFEE12:1;
                volatile uint32_t IFEE11:1;
                volatile uint32_t IFEE10:1;
                volatile uint32_t IFEE9:1;
                volatile uint32_t IFEE8:1;
                volatile uint32_t IFEE7:1;
                volatile uint32_t IFEE6:1;
                volatile uint32_t IFEE5:1;
                volatile uint32_t IFEE4:1;
                volatile uint32_t IFEE3:1;
                volatile uint32_t IFEE2:1;
                volatile uint32_t IFEE1:1;
                volatile uint32_t IFEE0:1;
            } B;
        } IFEER;

        union {                 /* Interrupt Filter Enable Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t IFE15:1;
                volatile uint32_t IFE14:1;
                volatile uint32_t IFE13:1;
                volatile uint32_t IFE12:1;
                volatile uint32_t IFE11:1;
                volatile uint32_t IFE10:1;
                volatile uint32_t IFE9:1;
                volatile uint32_t IFE8:1;
                volatile uint32_t IFE7:1;
                volatile uint32_t IFE6:1;
                volatile uint32_t IFE5:1;
                volatile uint32_t IFE4:1;
                volatile uint32_t IFE3:1;
                volatile uint32_t IFE2:1;
                volatile uint32_t IFE1:1;
                volatile uint32_t IFE0:1;
            } B;
        } IFER;

        int32_t SIU_reserved3[3];       /* {0x040-0x034}/4 = 0x03 */

