xwos/XWOS/xwcd/soc/powerpc/e200x/e200z0h/mpc560xb/mpc5604b.h
        union {                 /* Pad Configuration Registers */
            volatile uint16_t R;
            struct {
                volatile uint16_t:1;
                volatile uint16_t SMC:1;
                volatile uint16_t APC:1;
                  volatile uint16_t:1;
                volatile uint16_t PA:2;
                volatile uint16_t OBE:1;
                volatile uint16_t IBE:1;
                  volatile uint16_t:2;
                volatile uint16_t ODE:1;
                  volatile uint16_t:2;
                volatile uint16_t SRC:1;
                volatile uint16_t WPE:1;
                volatile uint16_t WPS:1;
            } B;
        } PCR[123];

        int32_t SIU_reserved4[242];     /* {0x500-0x136}/0xF2 */

        union {                 /* Pad Selection for Multiplexed Input Register */
            volatile uint8_t R;
            struct {
                volatile uint8_t:4;
                volatile uint8_t PADSEL:4;
            } B;
        } PSMI[32];

        int32_t SIU_reserved5[56];      /* {0x600-0x520}/4 = 0x38 */

        union {                 /* GPIO Pin Data Output Registers */
            volatile uint8_t R;
            struct {
                volatile uint8_t:7;
                volatile uint8_t PDO:1;
            } B;
        } GPDO[124];

        int32_t SIU_reserved6[97];      /* {0x800-0x67C}/4 = 0x61 */

        union {                 /* GPIO Pin Data Input Registers */
            volatile uint8_t R;
            struct {
                volatile uint8_t:7;
                volatile uint8_t PDI:1;
            } B;
        } GPDI[124];

        int32_t SIU_reserved7[225];     /* {0xC00-0x87C}/0x4 = 0xE1 */

        union {                 /* Parallel GPIO Pin Data Output Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t PPD0:32;
            } B;
        } PGPDO[4];

        int32_t SIU_reserved8[12];      /* {0xC40-0xC10}/0x4 = 0x0C */

        union {                 /* Parallel GPIO Pin Data Input Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t PPDI:32;
            } B;
        } PGPDI[4];

        int32_t SIU_reserved9[12];      /* {0xC80-0xC50}/0x4 = 0x0C */

        union {                 /* Masked Parallel GPIO Pin Data Out Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t MASK:16;
                volatile uint32_t MPPDO:16;
            } B;
        } MPGPDO[8];

        int32_t SIU_reserved10[216];    /* {0x1000-0x0CA0}/4 = 0xD8 */

        union {                 /* Interrupt Filter Maximum Counter Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t:28;
                volatile uint32_t MAXCNT:4;
            } B;
        } IFMC[16];

        int32_t SIU_reserved11[16];     /* {0x1080-0x1040}/4 = 0x10 */

        union {                 /* Interrupt Filter Clock Prescaler Register */
            volatile uint32_t R;
            struct {
                volatile uint32_t:28;
                volatile uint32_t IFCP:4;
            } B;
        } IFCPR;

    };                          /* end of SIU_tag */
/****************************************************************************/
/*                          MODULE : SSCM                                   */
/****************************************************************************/
    struct SSCM_tag {
        union {
            volatile uint16_t R;
            struct {
                volatile uint16_t:4;
                volatile uint16_t NXEN:1;
                  volatile uint16_t:3;
                volatile uint16_t BMODE:3;
                  volatile uint16_t:1;
                volatile uint16_t ABD:1;
                  volatile uint16_t:3;
            } B;
        } STATUS;               /* Status Register */

        union {
            volatile uint16_t R;
            struct {
                volatile uint16_t SRAM_SIZE:5;
                volatile uint16_t PRSZ:5;
                volatile uint16_t PVLB:1;
                volatile uint16_t DTSZ:4;
                volatile uint16_t DVLD:1;
            } B;
        } MEMCONFIG;            /* System Memory Configuration Register */

        int16_t SSCM_reserved;

        union {
            volatile uint16_t R;
            struct {
                volatile uint16_t:14;
                volatile uint16_t PAE:1;
                volatile uint16_t RAE:1;
            } B;
        } ERROR;                /* Error Configuration Register */

        int16_t SSCM_reserved1[2];

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t PWD_HI:32;
            } B;
        } PWCMPH;               /* Password Comparison Register High Word */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t PWD_LO:32;
            } B;
        } PWCMPL;               /* Password Comparison Register Low Word */

    };                          /* end of SSCM_tag */
/****************************************************************************/
/*                          MODULE : STM                                   */
/****************************************************************************/
    struct STM_CHANNEL_tag {

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:31;
                volatile uint32_t CEN:1;
            } B;
        } CCR;                  /* STM Channel Control Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:31;
                volatile uint32_t CIF:1;
            } B;
        } CIR;                  /* STM Channel Interrupt Register */

        union {
            volatile uint32_t R;
        } CMP;                  /* STM Channel Compare Register 0 */

        int32_t STM_CHANNEL_reserved;

    };                          /* end of STM_CHANNEL_tag */

    struct STM_tag {

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t CPS:8;
                  volatile uint32_t:6;
                volatile uint32_t FRZ:1;
                volatile uint32_t TEN:1;
            } B;
        } CR;                   /* STM Control Register */

        union {
            volatile uint32_t R;
        } CNT;                  /* STM Count Register */

        int32_t STM_reserved[2];

        struct STM_CHANNEL_tag CH[4];

    };                          /* end of STM_tag */
/****************************************************************************/
/*                          MODULE : SWT                                   */
/****************************************************************************/
    struct SWT_tag {
        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t MAP0:1;
                volatile uint32_t MAP1:1;
                volatile uint32_t MAP2:1;
                volatile uint32_t MAP3:1;
                volatile uint32_t MAP4:1;
                volatile uint32_t MAP5:1;
                volatile uint32_t MAP6:1;
                volatile uint32_t MAP7:1;
                  volatile uint32_t:15;
                volatile uint32_t RIA:1;
                volatile uint32_t WND:1;
                volatile uint32_t ITR:1;
                volatile uint32_t HLK:1;
                volatile uint32_t SLK:1;
                volatile uint32_t CSL:1;
                volatile uint32_t STP:1;
                volatile uint32_t FRZ:1;
                volatile uint32_t WEN:1;
            } B;
        } CR;                   /* SWT Control Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:31;
                volatile uint32_t TIF:1;
            } B;
        } IR;                   /* SWT Interrupt Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t WTO:32;
            } B;
        } TO;                   /* SWT Time-Out Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t WST:32;
            } B;
        } WN;                   /* SWT Window Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:16;
                volatile uint32_t WSC:16;
            } B;
        } SR;                   /* SWT Service Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t CNT:32;
            } B;
        } CO;                   /* SWT Counter Output Register */

    };                          /* end of SWT_tag */
/****************************************************************************/
/*                          MODULE : WKUP                                   */
/****************************************************************************/
    struct WKUP_tag {
        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t NIF0:1;
                volatile uint32_t NOVF0:1;
                  volatile uint32_t:30;
            } B;
        } NSR;                  /* NMI Status Register */

