xwos/XWOS/xwcd/soc/powerpc/e200x/e200z0h/mpc560xb/mpc5604b.h
        int32_t WKUP_reserved;

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t NLOCK:1;
                volatile uint32_t NDSS:2;
                volatile uint32_t NWRE:1;
                  volatile uint32_t:1;
                volatile uint32_t NREE:1;
                volatile uint32_t NFEE:1;
                volatile uint32_t NFE:1;
                  volatile uint32_t:24;
            } B;
        } NCR;                  /* NMI Configuration Register */

        int32_t WKUP_reserved1[2];

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:12;
                volatile uint32_t EIF:20;
            } B;
        } WISR;                 /* Wakeup/Interrupt Status Flag Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:12;
                volatile uint32_t EIRE:20;
            } B;
        } IRER;                 /* Interrupt Request Enable Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:12;
                volatile uint32_t WRE:20;
            } B;
        } WRER;                 /* Wakeup Request Enable Register */

        int32_t WKUP_reserved2[2];

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:12;
                volatile uint32_t IREE:20;
            } B;
        } WIREER;               /* Wakeup/Interrupt Rising-Edge Event Enable Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:12;
                volatile uint32_t IFEE:20;
            } B;
        } WIFEER;               /* Wakeup/Interrupt Falling-Edge Event Enable Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:12;
                volatile uint32_t IFE:20;
            } B;
        } WIFER;                /* Wakeup/Interrupt Filter Enable Register */

        union {
            volatile uint32_t R;
            struct {
                volatile uint32_t:12;
                volatile uint32_t IPUE:20;
            } B;
        } WIPUER;               /* Wakeup/Interrupt Pullup Enable Register */

    };                          /* end of WKUP_tag */
/******************************************************************
| defines and macros (scope: module-local)
|-----------------------------------------------------------------*/
/* Define instances of modules */
#define ADC_0     (*(volatile struct ADC_tag *)       0xFFE00000UL)
#define CAN_0     (*(volatile struct FLEXCAN_tag *)   0xFFFC0000UL)
#define CAN_1     (*(volatile struct FLEXCAN_tag *)   0xFFFC4000UL)
#define CAN_2     (*(volatile struct FLEXCAN_tag *)   0xFFFC8000UL)
#define CAN_3     (*(volatile struct FLEXCAN_tag *)   0xFFFCC000UL)
#define CAN_4     (*(volatile struct FLEXCAN_tag *)   0xFFFD0000UL)
#define CAN_5     (*(volatile struct FLEXCAN_tag *)   0xFFFD4000UL)
#define CANSP     (*(volatile struct CANSP_tag *)     0xFFE70000UL)
#define CFLASH    (*(volatile struct CFLASH_tag *)    0xC3F88000UL)
#define CGM       (*(volatile struct CGM_tag *)       0xC3FE0000UL)
#define CTU       (*(volatile struct CTU_tag *)       0xFFE64000UL)
#define DFLASH    (*(volatile struct DFLASH_tag *)    0xC3F8C000UL)
#define DSPI_0    (*(volatile struct DSPI_tag *)      0xFFF90000UL)
#define DSPI_1    (*(volatile struct DSPI_tag *)      0xFFF94000UL)
#define DSPI_2    (*(volatile struct DSPI_tag *)      0xFFF98000UL)
#define DSPI_3    (*(volatile struct DSPI_tag *)      0xFFF9C000UL)
#define ECSM      (*(volatile struct ECSM_tag *)      0xFFF40000UL)
#define EMIOS_0   (*(volatile struct EMIOS_tag *)     0xC3FA0000UL)
#define EMIOS_1   (*(volatile struct EMIOS_tag *)     0xC3FA4000UL)
#define I2C       (*(volatile struct I2C_tag *)       0xFFE30000UL)
#define INTC      (*(volatile struct INTC_tag *)      0xFFF48000UL)
#define LINFLEX_0 (*(volatile struct LINFLEX_tag *)   0xFFE40000UL)
#define LINFLEX_1 (*(volatile struct LINFLEX_tag *)   0xFFE44000UL)
#define LINFLEX_2 (*(volatile struct LINFLEX_tag *)   0xFFE48000UL)
#define LINFLEX_3 (*(volatile struct LINFLEX_tag *)   0xFFE4C000UL)
#define ME        (*(volatile struct ME_tag *)        0xC3FDC000UL)
#define MPU       (*(volatile struct MPU_tag *)       0xFFF10000UL)
#define PCU       (*(volatile struct PCU_tag *)       0xC3FE8000UL)
#define PIT       (*(volatile struct PIT_tag *)       0xC3FF0000UL)
#define RGM       (*(volatile struct RGM_tag *)       0xC3FE4000UL)
#define RTC       (*(volatile struct RTC_tag *)       0xC3FEC000UL)
#define SIU       (*(volatile struct SIU_tag *)       0xC3F90000UL)
#define SSCM      (*(volatile struct SSCM_tag *)      0xC3FD8000UL)
#define STM       (*(volatile struct STM_tag *)       0xFFF3C000UL)
#define SWT       (*(volatile struct SWT_tag *)       0xFFF38000UL)
#define WKUP      (*(volatile struct WKUP_tag *)      0xC3F94000UL)

#ifdef __MWERKS__
#pragma pop
#endif

#ifdef  __cplusplus
}
#endif

#endif  /* ifdef __MPC5_REG_H__ */

/* End of file */
